cask_args appdir: "/Applications"

# Shell & Terminal
brew "zsh"
brew "starship"  # Modern prompt

# Version Control
brew "git"
brew "gh"        # GitHub CLI
brew "lazygit"   # Terminal UI for git

# Text Editors
brew "vim"

# Development Tools
brew "tree"      # Directory tree viewer
brew "peco"      # Interactive filtering
brew "wget"      # File downloader
brew "cloc"      # Code line counter
brew "plantuml"  # UML diagram generator
brew "fzf"       # zplug

# Language Version Managers
brew "goenv"     # Go version manager
brew "rbenv"     # Ruby version manager
brew "ruby-build"

# Programming Languages & Runtimes
brew "go"
brew "ruby"
brew "openjdk"
brew "openjdk@17"

# Mobile Development
brew "cocoapods" # iOS dependency manager

# Applications
cask "alfred"
cask "claude-code"
cask "dropbox"
cask "figma"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "notion"
cask "slack"
cask "visual-studio-code"
cask "zoom"
