cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/cask-versions"

brew "git"
brew "vim"
brew "zsh"
brew "peco"
brew "lazygit"
brew "starship"
brew "zulu11" # Apple Slicon対応のJDK11
brew "php" #alfred Github workflow

cask "google-chrome"
cask "slack"
cask "iterm2"
cask "notion"
cask "alfred"
cask "zoom"
cask "visual-studio-code"
cask "dropbox"
cask "figma"

